In [11]:
import pandas as pd
from numpy.random import randn

In [12]:
df1=pd.DataFrame(randn(5,3), columns = ['A',"B","C"])

In [13]:
df1

          A         B         C
0  1.311255  0.399697  0.616870
1 -1.513415  0.632495 -0.987401
2  0.010610 -2.076206 -0.753972
3  1.104554 -0.110876  0.657460
4 -1.849007  1.084965 -0.552067

In [14]:
df1.columns.tolist()

['A', 'B', 'C']

In [15]:
df1.columns = ("X","Y","Z")

In [16]:
df1

          X         Y         Z
0  1.311255  0.399697  0.616870
1 -1.513415  0.632495 -0.987401
2  0.010610 -2.076206 -0.753972
3  1.104554 -0.110876  0.657460
4 -1.849007  1.084965 -0.552067

In [17]:
df1.drop("Z",axis=1)
#axis 1 = columns and axis 0 = rows (x axis)
#by default, the drop command will drop a row (axis=0)

          X         Y
0  1.311255  0.399697
1 -1.513415  0.632495
2  0.010610 -2.076206
3  1.104554 -0.110876
4 -1.849007  1.084965

In [18]:
#to drop the column for good (not just in the copy)
df1.drop("Z", axis=1, inplace=True)

In [19]:
df1

          X         Y
0  1.311255  0.399697
1 -1.513415  0.632495
2  0.010610 -2.076206
3  1.104554 -0.110876
4 -1.849007  1.084965

In [20]:
df2 = pd.DataFrame(randn(5, 2), columns = ["X","Y"])

In [21]:
df2

          X         Y
0 -0.713562 -0.493667
1 -1.178388  1.768194
2 -0.677950 -1.236868
3  1.489095 -0.111787
4 -0.046725 -0.668833

In [22]:
#how to unite 2 dataframes together
#concatenate df1 and df2 as a list
#use the concatenate command from pandas
pd.concat([df1,df2])

          X         Y
0  1.311255  0.399697
1 -1.513415  0.632495
2  0.010610 -2.076206
3  1.104554 -0.110876
4 -1.849007  1.084965
0 -0.713562 -0.493667
1 -1.178388  1.768194
2 -0.677950 -1.236868
3  1.489095 -0.111787
4 -0.046725 -0.668833

In [23]:
data = pd.concat([df1,df2], ignore_index=True)
#the ignore index will give us a continuous index

In [24]:
data

          X         Y
0  1.311255  0.399697
1 -1.513415  0.632495
2  0.010610 -2.076206
3  1.104554 -0.110876
4 -1.849007  1.084965
5 -0.713562 -0.493667
6 -1.178388  1.768194
7 -0.677950 -1.236868
8  1.489095 -0.111787
9 -0.046725 -0.668833

In [25]:
#shape = first parameters is the number of rows; the second is the number of columns
df1.shape

(5, 2)

In [27]:
data.shape

(10, 2)

In [32]:
df3 = pd.DataFrame(randn (4,5), columns = ['stripes','polkadots','two-tone','swirls','gradient'])

In [33]:
df3

    stripes  polkadots  two-tone    swirls  gradient
0 -2.074970  -0.132237 -0.510028  0.128350 -1.770249
1  0.295036  -1.932243  0.072742  0.323828 -1.468477
2 -0.247079   0.869621  0.494528 -0.833570  1.999599
3 -1.027641  -0.611133 -0.521899  0.841760 -1.237016